---
kind: type
id: T:Autodesk.Revit.DB.RoutingCondition
source: html/6be26c12-2586-0898-e080-6e5c9018bfcd.htm
---
# Autodesk.Revit.DB.RoutingCondition

RoutingCondition represents routing information that is used as input when determining if a routing criterion,
 such as minimum or maximum diameter, is met.

## Syntax (C#)
```csharp
public class RoutingCondition : IDisposable
```